1s/ERP/Conf/Catalogs/Лико_ФормулыПантонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_ФормулыПантонов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПлощадкаУдалить</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПечатиСтарый</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТМЦ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ВидыТМЦ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПечати</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ВидыПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЛинкс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентВСмеси</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_ФормулыПантонов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Асинх Процедура Лико_СоздатьНоменклатуруПантонаПосле(Команда)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Ждать ПредупреждениеАсинх("Необходимо записать формулу пантона!");
		 Возврат;
	КонецЕсли;
	Если ПроверкаЗаполненияПолей() Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		
		НаименованиеПантона=ПолучитьНаименованиеПантона();
		
		Текст=СтрШаблон("Создать номенклатуру пантона :%1 ?",НаименованиеПантона);
		Ответ = Ждать ВопросАсинх(Текст, Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		СоздатьНоменклатуруНаСервере();
	КонецЕсли; 	
КонецПроцедуры

Процедура СоздатьНоменклатуруНаСервере () //+Лико m.shenderov 16.06.2021
	
		
		//Объект.Номенклатура=Справочники.Лико_ФормулыПантонов.СодатьНоменклатуруСмеси(Объект.Ссылка,Объект.ВидТМЦ,Объект.ВидПечати,Объект.Состав[0].Номенклатура);
	
	  Объект.Номенклатура=
	Справочники.Лико_ФормулыПантонов.СодатьНоменклатуруСмеси(?(ЗначениеЗаполнено(Объект.Ссылка),Объект.Ссылка,Новый Структура("Наименование",Объект.Наименование))
	,Объект.ВидТМЦ,
	Объект.ВидПечати,
	Объект.Состав[0].Номенклатура);
	

КонецПроцедуры //-Лико m.shenderov 16.06.2021


&НаКлиенте
Функция ПроверкаЗаполненияПолей() Экспорт  //+Лико m.shenderov 28.04.2021
	Результат=Истина;
	СообщитьПользователю(Объект.Состав,"Объект.Состав","Состав",Результат);
	СообщитьПользователю(Объект.ВидПечати,"Объект.ВидПечати","Вид Печати",Результат);
	СообщитьПользователю(Объект.ВидТМЦ,"Объект.ВидТМЦ","Вид ТМЦ",Результат);
	СообщитьПользователю(Объект.Наименование,"Объект.Наименование","Наименование",Результат);

	
	Если Объект.Площадка = ПредопределенноеЗначение("Справочник.Лико_Площадки.ИксПак") Тогда		
		СообщитьПользователю(Объект.ЦеноваяГруппа,"Объект.ЦеноваяГруппа","Ценовая группа",Результат);
		//СообщитьПользователю(Объект.ВидПечати,"Объект.Номенклатура","Номенклатура",Результат); 		
	КонецЕсли;
	
	
	Возврат Результат;	
КонецФункции //-Лико m.shenderov 28.04.2021 

&НаКлиенте
Процедура СообщитьПользователю(Поле,РеквизитПоля,Текст,Результат) Экспорт 
	Если Не ЗначениеЗаполнено(Поле) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Не заполнен реквизит: %1",Текст);
		Сообщение.Поле = РеквизитПоля; //имя реквизита 
		
		Сообщение.Сообщить(); 		
		Результат=Ложь;	
	КонецЕсли;
КонецПроцедуры


Функция ПолучитьНаименованиеПантона() //+Лико m.shenderov 16.06.2021
		 Возврат СокрЛП(Объект.ВидТМЦ)+"_"+ СокрЛП(Объект.ВидПечати)+"_"+СокрЛП(Объект.Наименование);
КонецФункции //-Лико m.shenderov 16.06.2021 


&НаКлиенте
Асинх Процедура СоздатьНоменклатуруПантона(Команда)
	
	Если Объект.Состав.Количество()>0 и НЕ ЗначениеЗаполнено(Объект.Состав[0].Номенклатура ) Тогда
		
		Ждать ПредупреждениеАсинх("Не указана номенклатура  смеси!");
		Возврат;
	КонецЕсли;
	
	
	Если ПроверкаЗаполненияПолей() Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		
		НаименованиеПантона=ПолучитьНаименованиеПантона();
		
		Текст=СтрШаблон("Создать номенклатуру пантона :%1 ?",НаименованиеПантона);
		Ответ = Ждать ВопросАсинх(Текст, Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		СоздатьНоменклатуруНаСервере();
	КонецЕсли; 	
	
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры
